sfera3d/snappySpher/test2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       514602;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       516202;
    }
    sides
    {
        type            patch;
        nFaces          6400;
        startFace       517802;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30144;
        startFace       524202;
    }
)

// ************************************************************************* //
