sfera3d/snappySpher/test2/system/acoDict/curleDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      curleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat gnuplot;
surfaceFormat foamFile;

interpolationScheme cell;
timeWindows 148;  
timeStep 0.002;
numberCells 245112;
ndir   1;
ndirz  1;
radius 24;

mic_x  0.5;
mic_y  0.5;
mic_z  0.0;

rho 1000;
c0  1400.0;
u0  1.0;

// Fields to sample.
fields
(
    p 
);

sets
(

);

surfaces
(
    walls
    {
        // Sampling on triSurface
        type        patch;
        patches     (sphere);
        //surface     ref0.stl;
        source      cells;  //sample cells or boundaryFaces
        interpolate false;
    }

);



// *********************************************************************** //

